constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1280;
        startFace       203520;
    }
    outerBC
    {
        type            patch;
        nFaces          1280;
        startFace       204800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          204800;
        startFace       206080;
    }
)

// ************************************************************************* //
